INSERT INTO students (name, kana_name, nickname, email_address, residence, age, gender, remark, was_deleted)
VALUES
    ('山田太郎', 'ヤマダタロウ', 'タロウ', 'taro@example.com', '東京', 25, '男性', '最初の登録者', FALSE),
    ('鈴木一郎', 'スズキイチロウ', 'イチ', 'ichiro@example.com', '大阪', 30, '男性', NULL, FALSE),
    ('田中花子', 'タナカハナコ', 'ハナ', 'hana@example.com', '北海道', 22, '女性', '若手のメンバー', FALSE),
    ('佐藤良子', 'サトウリョウコ', 'リョウ', 'ryoko@example.com', '福岡', 28, '女性', NULL, FALSE),
    ('伊藤悠', 'イトウハルカ', 'ハルカ', 'haruka@example.com', '愛知', 35, 'その他', '退会済み', TRUE);

INSERT INTO student_courses (student_id, course_name, course_start_at, course_end_at)
VALUES
    (1, 'Javaコース', '2023-04-01 09:00:00', '2023-07-01 15:00:00'),
    (1, 'AWSコース', '2023-05-01 10:00:00', '2023-08-01 16:00:00'),
    (2, 'デザインコース', '2023-06-01 11:00:00', '2023-09-01 17:00:00'),
    (3, 'Web制作コース', '2023-07-01 12:00:00', '2023-10-01 18:00:00'),
    (3, 'デザインコース', '2023-08-01 13:00:00', '2023-11-01 19:00:00'),
    (3, 'マーケティングコース', '2023-09-01 09:00:00', '2024-01-01 15:00:00'),
    (4, 'Javaコース', '2023-10-01 10:00:00', '2024-02-01 16:00:00'),
    (4, 'マーケティングコース', '2023-11-01 11:00:00', '2024-03-01 17:00:00'),
    (5, 'AWSコース', '2023-12-01 12:00:00', '2024-04-01 18:00:00'),
    (1, 'Web制作コース', '2024-01-01 13:00:00', '2024-05-01 19:00:00');

INSERT INTO application_status (course_ID, application_status)
VALUES
    (1, '受講中'),
    (2, '受講中'),
    (3, '本申込'),
    (4, '仮申込'),
    (5, '本申込'),
    (6, '受講終了'),
    (7, '受講終了'),
    (8, '本申込'),
    (10, '仮申込'),
    (11, '受講中');
